In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1= {
    "name":['harry','rohan','skillf','shubh'],
    "marks":[92,34,24,47],
    "city":['rampur','patna','gajipur','Arrah']
}

In [3]:
dict1

{'name': ['harry', 'rohan', 'skillf', 'shubh'],
 'marks': [92, 34, 24, 47],
 'city': ['rampur', 'patna', 'gajipur', 'Arrah']}

In [5]:
df=pd.DataFrame(dict1)

In [6]:
df

     name  marks     city
0   harry     92   rampur
1   rohan     34    patna
2  skillf     24  gajipur
3   shubh     47    Arrah

In [7]:
df.to_csv('friend.csv')

In [9]:
df.to_csv('friend.csv',index=False)

In [11]:
df.head(2)

    name  marks    city
0  harry     92  rampur
1  rohan     34   patna

In [12]:
df.tail()

     name  marks     city
0   harry     92   rampur
1   rohan     34    patna
2  skillf     24  gajipur
3   shubh     47    Arrah

In [14]:
df.describe()

           marks
count   4.000000
mean   49.250000
std    30.015274
min    24.000000
25%    31.500000
50%    40.500000
75%    58.250000
max    92.000000